app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    @posts = Post.paginate(page: params[:page], per_page: 6).limit(6)